#-*- coding: UTF-8

caledFieldsBase="""
账务分类
发生日期

关联销售合同名称
记账方
对方
B01_采购合同额
B02_采购收票额
B03_采购支出额
B04_采购合同成本
B05_采购收票成本


C01_费用计划额
C02_费用支付额
C12_应收管理费
C13_已收管理费
D01_销售合同额
D02_销售开票额
D03_销售收款额
D04_销售合同收入
D05_销售开票收入
F11_发票附加税费
F10_增值附加税费
S11_增值税额
S12_发票税额
序号
合同大类
合同子类
费用子类
状态
签署方式
"""

simpleCledFields="""
账务分类
发生日期
关联销售合同名称
X10_现金流余额
L10_现有利润额
L11_项目利润额
B11_采购待收票
S13_待纳增值税额
B12_采购应付款
B13_采购待付款
C11_费用待支额
F12_待纳附加税费额
D16_销售应收款
D17_销售待收款
D15_销售待开票
记账方
对方
状态
合同大类
合同子类
费用子类
"""

caledFields = caledFieldsBase + simpleCledFields  # 显示所有计算数据
# caledFields = simpleCledFields  # 仅显示利润、现金流余额、待完成的数据